ELPasEDT/src/Documents/ПриходРеагента/ПриходРеагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходРеагента</name>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Концентрация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПлотностьПриРасчетеКоличества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

ELPasEDT/src/AccumulationRegisters/РеагентыВПодразделениях/РеагентыВПодразделениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РеагентыВПодразделениях</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМоногидратаВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ELPasEDT/src/Documents/ПриходРеагента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РеагентыВПодразделениях Приход
	Движения.РеагентыВПодразделениях.Записывать = Истина;
	Движение = Движения.РеагентыВПодразделениях.Добавить();
	Движение.Период        = Дата;
	Движение.ВидДвижения   = ВидДвиженияНакопления.Приход;
	
	Движение.Подразделение = Подразделение;
	Движение.ВидРеагента   = ВидРеагента;
	Движение.Партия        = Ссылка;
	Движение.Реагент       = Реагент;
	
	Движение.Количество                = Количество;
	Движение.КоличествоВБазовойЕдинице = Количество * ЕдиницаИзмеренияКоличества.Коэффициент;	
	Движение.КоличествоМоногидратаВБазовойЕдинице = Движение.КоличествоВБазовойЕдинице * Концентрация / 100
		* ЕдиницаИзмеренияКонцентрации.Коэффициент;
	
	
	Если УчитыватьПлотностьПриРасчетеКоличества 
		И ЗначениеЗаполнено(Плотность) 
		И ЗначениеЗаполнено(ЕдиницаИзмеренияПлотности)
		И ЗначениеЗаполнено(ЕдиницаИзмеренияПлотности.Коэффициент) 
		Тогда
		
		Движение.КоличествоВБазовойЕдинице = Движение.КоличествоВБазовойЕдинице 
			* Плотность * ЕдиницаИзмеренияПлотности.Коэффициент;
			
		Движение.КоличествоМоногидратаВБазовойЕдинице = Движение.КоличествоМоногидратаВБазовойЕдинице
			* Плотность * ЕдиницаИзмеренияПлотности.Коэффициент;
			
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Организация   = Подразделение.Организация;
КонецПроцедуры
